 // Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
 for (let i = 20; i <= 30; i = i + 0.5) {
     console.log(i)
 }

 // Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
 let a = 27;
 for (let i = 10; i <= 100; i = i + 10) {
     console.log(i * a);
 }

 // Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
 let m = +prompt("Enter a number n:");
 let n = Math.sqrt(m)

 for (let i = 1; i <= 100; i++)
     if (i < n) {
         console.log(i);
     }

 // // Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
 let m = +prompt("Enter a number:");

 function primeNumb(num) {
     if (num > 1) {
         for (let i = 2; i < num; i++) {
             if (num % i == 0) {
                 return false;
             }
         }
         return true;
     } else {
         return "Число должно быть больше 1";
     }
 }

 console.log(primeNumb(m));

 // Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

 let n = prompt("Введите число n", 0);
 if (n != null) {
     let x = 0;
     let n1 = 0;
     do {
         x++;
         n1 = Math.pow(3, x);
     } while (n1 < n);
     if (n1 == n)
         alert("Число n = 3 в степени " + x);
     else
         alert("Число n не является степенью числа 3");
 }